
/***************************************************************************
 *                                                                         *
 *                     _____     ____                                      *
 *                    |  __ \   / __ \   _     _ _____                     *
 *                    | |  \ \ / /  \_\ | |   | |  _  \                    *
 *                    | |   \ \| |      | |   | | |_| |                    *
 *                    | |   | || |      | |   | |  ___/                    *
 *                    | |   / /| |   __ | |   | |  _  \                    *
 *                    | |__/ / \ \__/ / | |___| | |_| |                    *
 *                    |_____/   \____/  |_____|_|_____/                    *
 *                                                                         *
 *                       Wiimms source code library                        *
 *                                                                         *
 ***************************************************************************
 *                                                                         *
 *        Copyright (c) 2012-2022 by Dirk Clemens <wiimm@wiimm.de>         *
 *                                                                         *
 ***************************************************************************
 *                                                                         *

ColNameLevelBMG;

extern uint		opt_bmg_force_count;	// >0: force some operations
extern uint		opt_bmg_align;		// alignment of raw-bg sections
extern bool		opt_bmg_export;		// true: optimize for exports
extern bool		opt_bmg_no_attrib;	// true: suppress attributes
extern bool		opt_bmg_x_escapes;	// true: use x-scapes insetad of z-escapes
extern bool		opt_bmg_old_escapes;	// true: use only old escapes
extern int		opt_bmg_single_line;	// >0: single line, >1: suppress atrributes
extern bool		opt_bmg_inline_attrib;	// true: print attrinbutes inline
extern bool		opt_bmg_support_mkw;	// true: support MKW specific extensions
extern bool		opt_bmg_support_ctcode;	// true: support MKW/CT-CODE specific extensions
extern bool		opt_bmg_support_lecode;	// true: support MKW/LE-CODE specific extensions
extern uint		opt_bmg_rcup_fill_limit;// >0: limit racing cups to reduce BMG size
extern uint		opt_bmg_track_fill_limit;// >0: limit tracks to reduce BMG size
extern int		opt_bmg_colors;		// use c-escapes: 0:off, 1:auto, 2:on
extern ColNameLevelBMG	opt_bmg_color_name;
extern uint		opt_bmg_max_recurse;	// max recurse depth
extern bool		opt_bmg_allow_print;	// true: allow '$' to print a log message
extern bool		opt_bmg_use_slots;	// true: use predifined slots
extern bool		opt_bmg_use_raw_sections;// true: use raw sections

//-----------------------------------------------------------------------------

extern int		opt_bmg_endian;
extern int		opt_bmg_encoding;
extern uint		opt_bmg_inf_size;
extern OffOn_t		opt_bmg_mid;
extern bool		opt_bmg_force_attrib;
extern bool		opt_bmg_def_attrib;

extern u8		bmg_force_attrib[BMG_ATTRIB_SIZE];
extern u8		bmg_def_attrib[BMG_ATTRIB_SIZE];


// 'PatchKeysBMG->opt'
//	0: no param
//	1: file param
//	2: string param
extern const KeywordTab_t PatchKeysBMG[];

extern const sizeof_info_t sizeof_info_bmg[];

//
///////////////////////////////////////////////////////////////////////////////
///////////////			CT/LE support			///////////////
///////////////////////////////////////////////////////////////////////////////
// [[ct_mode_t]]

typedef enum ct_mode_t
{
    CTM_NO_INIT,		// don't initialize, don't change value
    CTM_NINTENDO,		// original Nintendo mdoe with 32 tracks
    CTM_AUTO,			// use fallback
    CTM_OPTIONS,		// use options opt_bmg_support_{le,ct}code

    CTM_CTCODE_BASE = 0x10,	// base for all CT-CODEs
    CTM_CTCODE,			// CT-CODE (v1)

    CTM_LECODE_BASE = 0x20,	// base for all LE-CODEs
    CTM_LECODE1,		// LE-CODE phase 1 [[not longer used]]
    CTM_LECODE2,		// LE-CODE phase 2

    CTM_LECODE_MIN = CTM_LECODE2, // minimal LE-PHASE
    CTM_LECODE_DEF = CTM_LECODE2, // default LE-PHASE
    CTM_LECODE_MAX = CTM_LECODE2, // maximal LE-PHASE
}
ct_mode_t;

ct_mode_t NormalizeCtModeBMG ( ct_mode_t mode, ct_mode_t fallback );
ct_mode_t SetupCtModeBMG ( ct_mode_t mode );
ccp GetCtModeNameBMG ( ct_mode_t mode, bool full );

///////////////////////////////////////////////////////////////////////////////
// [[bmg_range_t]]

typedef struct bmg_range_t
{
    u32 beg;	// id of first MID
    u32 end;	// id of last MID+1
    u32 n;	// number of MIDs := end-beg
}
bmg_range_t;

///////////////////////////////////////////////////////////////////////////////
// [[ct_bmg_t]]

typedef struct ct_bmg_t
{
    ct_mode_t	ct_mode;	// normalized CT mode
    int		version;	// a version number
    uint	is_ct_code;	// 0:off, 1:CT-CODE, 2:CT+LE-CODE
    uint	le_phase;	// >0: LE-CODE enabled in phase #

    u32		identify;	// MID if ifentification
    bmg_range_t	param;		// MID range of parameters

    bmg_range_t	range;		// MID range of this section (min,max)
    bmg_range_t	rcup_name;	// MID range of racing cup names
    bmg_range_t	bcup_name;	// MID range of battle cup names (maybe part of rcup_name)
    bmg_range_t	track_name1;	// MID range of track names, first set
    bmg_range_t	track_name2;	// 0 or MID range of track names, second set
    bmg_range_t	arena_name1;	// MID range of arena names, first set
    bmg_range_t	arena_name2;	// 0 or MID range of arena names, second set
    bmg_range_t	cup_ref;	// MID range of battle track_to_cup references
    bmg_range_t	random;		// MID for RANDOM
}
ct_bmg_t;

ct_mode_t SetupCtBMG ( ct_bmg_t *ctb, ct_mode_t mode, ct_mode_t fallback );
static inline void ResetCtBMG ( ct_bmg_t *ctb ) {}
ccp GetCtBMGIdentification ( ct_bmg_t *ctb, bool full ); // message for MID_PARAM_IDENTIFY
void DumpCtBMG ( FILE *f, int indent, ct_bmg_t *ctb );

//
///////////////////////////////////////////////////////////////////////////////
///////////////		    global string functions		///////////////
///////////////////////////////////////////////////////////////////////////////

// returns 1..N
uint GetWordLength16BMG ( const u16 *source );

uint GetLength16BMG
(
    const u16		* sourse,	// source
    uint		max_len		// max possible length
);

//-----------------------------------------------------------------------------

uint PrintString16BMG
(
    char		*buf,		// destination buffer
    uint		buf_size,	// size of 'buf'
    const u16		*src,		// source
    int			src_len,	// length of source in u16 words, -1:NULL term
    u16			utf8_max,	// max code printed as UTF-8
    uint		quote,		// 0:no quotes, 1:escape ", 2: print in quotes
    int			use_color	// >0: use \c{...}
);

// [[xbuf]] [[2do]] not implemented yet
uint PrintFastBuf16BMG
(
    FastBuf_t		*fb,		// destination buffer (data appended)
    const u16		*src,		// source
    int			src_len,	// length of source in u16 words, -1:NULL term
    u16			utf8_max,	// max code printed as UTF-8
    uint		quote,		// 0:no quotes, 1:escape ", 2: print in quotes
    int			use_color	// >0: use \c{...}
);

//-----------------------------------------------------------------------------

uint ScanString16BMG
(
    u16			*buf,		// destination buffer
    uint		buf_size,	// size of 'buf' in u16 words
    ccp			src,		// UTF-8 source
    int			src_len,	// length of source, -1: determine with strlen()
    const bmg_t		*bmg		// NULL or support for \m{...}
);

// [[xbuf]] [[2do]] not implemented yet
uint ScanFastBuf16BMG
(
    FastBuf_t		*fb,		// destination buffer (data appended)
    ccp			src,		// UTF-8 source
    int			src_len,	// length of source, -1: determine with strlen()
    const bmg_t		*bmg		// NULL or support for \m{...}
);

//
///////////////////////////////////////////////////////////////////////////////
///////////////			struct bmg_header_t		///////////////
///////////////////////////////////////////////////////////////////////////////
// [[bmg_section_t]]

typedef struct bmg_section_t
{
 /*00*/  char		magic[4];	// a magic to identity the section
 /*04*/  be32_t		size;		// total size of the section
 /*08*/  u8		data[0];	// section data
}
__attribute__ ((packed)) bmg_section_t;

//-----------------------------------------------------------------------------
// [[bmg_endian_t]]

typedef enum bmg_endian_t
{
    BMG_AUTO_ENDIAN,
    BMG_BIG_ENDIAN,	// used in MKWii
    BMG_LITTLE_ENDIAN,

    BMG_DEFAULT_ENDIAN	= BMG_BIG_ENDIAN,
}
__attribute__ ((packed)) bmg_endian_t;

extern const KeywordTab_t TabEndianBMG[];
ccp GetEndianNameBMG	( int endian, ccp return_if_invalid );

//-----------------------------------------------------------------------------
// [[bmg_encoding_t]]

typedef enum bmg_encoding_t
{
    BMG_ENC_CP1252	= 1,
    BMG_ENC_UTF16BE	= 2,	// used in MKWii and AC
    BMG_ENC_SHIFT_JIS	= 3,
    BMG_ENC_UTF8	= 4,

    BMG_ENC__MIN	= BMG_ENC_CP1252,
    BMG_ENC__DEFAULT	= BMG_ENC_UTF16BE,
    BMG_ENC__MAX	= BMG_ENC_UTF8,
    BMG_ENC__UNDEFINED	= -1,	// only for option --bmg-encoding
}
__attribute__ ((packed)) bmg_encoding_t;

extern const KeywordTab_t TabEncodingBMG[];
ccp GetEncodingNameBMG	( int encoding, ccp return_if_invalid );
int CheckEncodingBMG	( int encoding, int return_if_invalid );

//-----------------------------------------------------------------------------
// [[bmg_header_t]]

typedef struct bmg_header_t
{
 /*00*/  char		magic[8];	// = BMG_MAGIC
 /*08*/  be32_t		size;		// total size of file
 /*0c*/  be32_t		n_sections;	// number of sections
 /*10*/  bmg_encoding_t	encoding;	// text encoding
 /*11*/  u8		unknown[15];	// unknown data
 /*20*/ //bmg_section_t	section[0];	// first section header
					// -> disabled because MVC
}
__attribute__ ((packed)) bmg_header_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			struct bmg_inf_t		///////////////
///////////////////////////////////////////////////////////////////////////////

#define BMG_INF_MAGIC		"INF1"
#define BMG_INF_STD_ATTRIB	0x01000000
#define BMG_INF_STD_SIZE	8
#define BMG_INF_DEFAULT_0C	0

//-----------------------------------------------------------------------------
// [[bmg_inf_item_t]]

typedef struct bmg_inf_item_t
{
 /*00*/  u32		offset;		// offset into text pool
 /*04*/  u8		attrib[0];	// attribute bytes
					// NKWii: MSByte used for font selection.
}
__attribute__ ((packed)) bmg_inf_item_t;

//-----------------------------------------------------------------------------
// [[bmg_inf_t]]

typedef struct bmg_inf_t
{
 /*00*/  char		magic[4];	// = BMG_INF_MAGIC
 /*04*/  be32_t		size;		// total size of the section
 /*08*/  be16_t		n_msg;		// number of messages
 /*0a*/  be16_t		inf_size;	// size of inf items
 /*0c*/  be32_t		unknown_0c;	// = BMG_INF_DEFAULT_0C = 0 for MKW
 /*10*/  bmg_inf_item_t	list[0];	// message list with (offset,attribute)
}
__attribute__ ((packed)) bmg_inf_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////		struct bmg_dat_t + bmg_str_t		///////////////
///////////////////////////////////////////////////////////////////////////////

#define BMG_DAT_MAGIC "DAT1"
#define BMG_STR_MAGIC "STR1"

//-----------------------------------------------------------------------------
// [[bmg_dat_t]]

typedef struct bmg_dat_t
{
 /*00*/  char		magic[4];	// = BMG_DAT_MAGIC
 /*04*/  be32_t		size;		// total size of the section
 /*08*/  u8		text_pool[];
}
__attribute__ ((packed)) bmg_dat_t;

//-----------------------------------------------------------------------------

// [[bmg_str_t]]
typedef bmg_dat_t bmg_str_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			struct bmg_mid_t		///////////////
///////////////////////////////////////////////////////////////////////////////

#define BMG_MID_MAGIC "MID1"
#define BMG_MID_DEFAULT_0A  0x1000
#define BMG_MID_DEFAULT_0C  0

//-----------------------------------------------------------------------------
// [[bmg_mid_t]]

typedef struct bmg_mid_t
{
 /*00*/  char		magic[4];	// = BMG_MID_MAGIC
 /*04*/  be32_t		size;		// total size of the section
 /*08*/  be16_t		n_msg;		// number of messages
 /*0a*/  be16_t		unknown_0a;	// = BMG_MID_DEFAULT_0A = 0x1000 for MKW
 /*0c*/  be32_t		unknown_0c;	// = BMG_MID_DEFAULT_0C = 0 for MKW
 /*10*/  u32		mid[0];		// message id table
}
__attribute__ ((packed)) bmg_mid_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			struct bmg_flw_t		///////////////
///////////////////////////////////////////////////////////////////////////////

#define BMG_FLW_MAGIC "FLW1"

//-----------------------------------------------------------------------------
// [[bmg_flw_t]]

typedef struct bmg_flw_t
{
 /*00*/  char		magic[4];	// = BMG_FLW_MAGIC
 /*04*/  be32_t		size;		// total size of the section
 /*08*/  u8		unknown[];	// ??? [[2do]]
}
__attribute__ ((packed)) bmg_flw_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			struct bmg_fli_t		///////////////
///////////////////////////////////////////////////////////////////////////////

#define BMG_FLI_MAGIC "FLI1"

//-----------------------------------------------------------------------------
// [[bmg_fli_t]]

typedef struct bmg_fli_t
{
 /*00*/  char		magic[4];	// = BMG_FLI_MAGIC
 /*04*/  be32_t		size;		// total size of the section
 /*08*/  u8		unknown[];	// ??? [[2do]]
}
__attribute__ ((packed)) bmg_fli_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////		bmg_sect_info_t & bmg_sect_list_t	///////////////
///////////////////////////////////////////////////////////////////////////////
// [[bmg_sect_info_t]]

typedef struct bmg_sect_info_t
{
    uint		offset;		// offset from beginning of file
    uint		sect_size;	// section size by section header
    uint		real_size;	// real section size
    uint		head_size;	// size of section header
    uint		elem_size;	// =0: unknown, >0: element size
    uint		n_elem_head;	// elem_size>0: number of elements by header
    uint		n_elem;		// 0: number of real elements
    bmg_section_t	*sect;		// pointer to raw source data
					// if NULL: list terminator
    bool		known;		// true: section known
    bool		supported;	// true: section fully supported
    bool		is_empty;	// true: complete data is NULL
